from langchain.prompts import ChatPromptTemplate
from langchain.prompts import FewShotChatMessagePromptTemplate

system_message = ("""
شما به عنوان یک دستیار هوشمند بانکی عمل می‌کنید.

وظیفه شما این است که نیت کاربر را تشخیص داده و اطلاعات مورد نیاز (اسلات‌ها) را استخراج کنید.

پاسخ را به صورت دقیق و در قالب زیر ارائه دهید:

نیت: [نیت کاربر]
اسلات‌ها: [اسلات‌ها به صورت دیکشنری پایتون]

اگر نیت یا اسلات‌ها را نمی‌توانید تشخیص دهید، بنویسید:

نیت: نامشخص
اسلات‌ها: '{{{{}}}}'

مثال‌ها:

کاربر: "موجودی حسابم چقدره؟"
پاسخ:
نیت: نمایش موجودی
اسلات‌ها: '{{{{}}}}'

کاربر: "می‌خوام ۵۰۰,۰۰۰ ریال به حساب 1234567890 منتقل کنم."
پاسخ:
نیت: انتقال وجه
اسلات‌ها: '{{{{'مبلغ': '۵۰۰,۰۰۰ ریال', 'شماره حساب مقصد': '1234567890'}}}}'

کاربر: "اپلیکیشن بانک همراه کار نمی‌کنه."
پاسخ:
نیت: رفع مشکل
اسلات‌ها: '{{{{'شرح مشکل': 'اپلیکیشن بانک همراه کار نمی‌کند'}}}}'

غیر از این خروجی هیچ خروجی دیگری نده
""")



examples = [
    {
        "question": "موجودی حسابم چقدره؟",
        "intent": "نمایش موجودی",
        "slots": "{}"
    },
    {
        "question": "می‌خوام ۵۰۰,۰۰۰ ریال به حساب 1234567890 منتقل کنم.",
        "intent": "انتقال وجه",
        "slots": "{'مبلغ': '۵۰۰,۰۰۰ ریال', 'شماره حساب مقصد': '1234567890'}"
    },
    {
        "question": "آخرین تراکنش‌هامو می‌خوام ببینم.",
        "intent": "نمایش تاریخچه تراکنش‌ها",
        "slots": "{}"
    },
    {
        "question": "اپلیکیشن بانک همراه کار نمی‌کنه.",
        "intent": "رفع مشکل",
        "slots": "{'شرح مشکل': 'اپلیکیشن بانک همراه کار نمی‌کند'}"
    },
    {
        "question": "چطور می‌تونم پول انتقال بدم؟",
        "intent": "انتقال وجه",
        "slots": "{}"
    },
    {
        "question": "مشکل ورود به حساب دارم.",
        "intent": "رفع مشکل",
        "slots": "{'شرح مشکل': 'مشکل در ورود به حساب'}"
    },
    {
        "question": "میرم داخل پروفایلم عکسمو نشون نمیده",
        "intent": "رفع مشکل",
        "slots": "{'شرح مشکل': 'مشکل در دیدن عکس پروفایل'}"
    },
]



example_prompt = ChatPromptTemplate.from_messages(
    [
        ("human", "{question}"),
        ("ai", "نیت: {intent}\nاسلات‌ها: {slots}")
    ]
)

few_shot_prompt = FewShotChatMessagePromptTemplate(
    example_prompt=example_prompt,
    examples=examples,
)


prompt = ChatPromptTemplate.from_messages([
    ("system", system_message),
    few_shot_prompt,
    ("human", "{question}")
])